#### SetCutLayerModifiers Method

---

|  |
| --- |
| ExportLayerInfo Class   See Also |

Sets a cut layer modifier array to the layer info.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public void SetCutLayerModifiers( 	IList<LayerModifier> cutLayermodifiers ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetCutLayerModifiers ( _ 	cutLayermodifiers As IList(Of LayerModifier) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetCutLayerModifiers( 	IList<LayerModifier^>^ cutLayermodifiers ) ``` |

#### Parameters

cutLayermodifiers
:   Type:  System.Collections.Generic IList   LayerModifier
     The cut layer modifier array.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ExportLayerInfo Class

Autodesk.Revit.DB Namespace